#Створіть функцію def double_zero(array) яка приймає цілочисельний масив і дублює всі нулі, повертаючи новий масив в якому нулі продубльювані, при дублювані всі інші елементи повинні бути зсунутті вправо.

#Тестувати функцію ви можете як завгодно: за допомогою модуля sys і аргументів програми, або за допомогою input() або в результаті викликів функції. Але в файлі double_zero.py повина бути створена функція def double_zero(array) яка виконує необхідну логіку.

#Приклади:

#double_zero([1,0,2,3,0,4,5,0]) -> [1,0,0,2,3,0,0,4,5,0,0]
#double_zero([1,0,2,3,0,4,5,0]) -> [1,0,0,2,3,0,0,4,5,0,0]
#double_zero([1,2,3]) -> [1,2,3]
#Завдання 3
#Файл: remove_duplicates.py Оцінка: 25

#Створіть функцію def remove_duplicates(array) яка приймає цілочисельний масив, відсортований у порядку зростання, видаліть дублікати чисел, щоб кожен унікальний елемент з’являвся лише один раз. Функція має повертати новий масив без дуплікатів чисел, відносний порядок елементів має бути незмінним

#Тестувати функцію ви можете як завгодно: за допомогою модуля sys і аргументів програми, або за допомогою input() або в результаті викликів функції. Але в файлі remove_duplicates.py повина бути створена функція def remove_duplicates(array) яка виконує необхідну логіку.

#Приклади:

#remove_duplicates([1,1,2]) -> [1,2]
#remove_duplicates([0,0,1,1,1,2,2,3,3,4]) -> [0,1,2,3,4]
#remove_duplicates([1,1,1,1,1,1,1,1]) -> [1]