#Створіть функцію def spiral(matrix) яка приймає цілочисельну матрицю розміром NxM та повертає масив в якому числа з матриці записані в порядку спіралі. Матриця виглядає наступним чином:

#[
#  [1,2,3],
#  [4,5,6],
#  [7,8,9]
#]
#Це масив цілочисельних масивів. Наприклад матриця розміром 3x4 виглядає ось так:

#[
#    [1,2,3,4],
#    [5,6,7,8],
#    [9,10,11,12]
#]
#Порядок спіралі виглядає ось так:
#m1

#m2

#Тестувати функцію ви можете як завгодно: за допомогою модуля sys і аргументів програми, або за допомогою input() або в результаті викликів функції. Але в файлі spiral.py повина бути створена функція def spiral(matrix) яка виконує необхідну логіку.

#Приклади:

#spiral([[1,2,3],[4,5,6],[7,8,9]]) -> [1,2,3,6,9,8,7,4,5]
#spiral([[1,2,3,4],[5,6,7,8],[9,10,11,12]]) -> [1,2,3,4,8,12,11,10,9,5,6,7]